cask_args appdir: "/Applications"

brew "bat"
brew "bun"
brew "make"
brew "cmake"
brew "curl"
brew "delta"
brew "ffmpeg"
brew "htop"
brew "neovim"
brew "pipx"
brew "rbenv"
brew "ruby-build"
brew "tmux"
brew "tree"
brew "uv"
brew "websocat"
brew "wget"
brew "wrk"
brew "python"
brew "poetry"
brew "go"
brew "zsh"
brew "jq"
brew "coreutils"
brew "git"
brew "git-secrets"
brew "git-delta"
brew "awscli"
brew "mkcert"
brew "fnm"
brew "gh"
brew "pnpm"
brew "yarn"
brew "mas"
brew "sqlite"
brew "tree-sitter"
brew "podman"
brew "podman-compose"
brew "certbot"
brew "snappy"
brew "fastfetch"
brew "oh-my-posh"
brew "fzf"
brew "zoxide"
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "antidote"
brew "gum"
brew "soft-serve"
brew "skate"
brew "melt"
brew "jesseduffield/lazygit/lazygit"
brew "tlrc"
brew "btop"
brew "atuin"
brew "httpie"

cask "font-fantasque-sans-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-fira-code"

cask "gpg-suite" unless system "test -e /Applications/GPG\\ Keychain.app"
cask "obsidian" unless system "test -e /Applications/Obsidian.app"
cask "raycast" unless system "test -e /Applications/Raycast.app"
cask "visual-studio-code" unless system "test -e /Applications/Visual\\ Studio\\ Code.app"
cask "google-chrome" unless system "test -e /Applications/Google\\ Chrome.app"
cask "firefox" unless system "test -e /Applications/Firefox.app"
cask "slack" unless system "test -e /Applications/Slack.app"
cask "docker-desktop" unless system "test -e /Applications/Docker.app"
cask "vlc" unless system "test -e /Applications/VLC.app"

# NOTE: Sometimes I might want to comment these out
#cask "cloudflare-warp" unless system "test -e /Applications/Cloudflare\\ WARP.app"
#cask "protonvpn" unless system "test -e /Applications/ProtonVPN.app"
#cask "protonmail-bridge" unless system "test -e /Applications/Proton\\ Mail\\ Bridge.app"
