cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "python"
brew "zsh"
brew "jq"
brew "coreutils"
brew "git"
brew "awscli"
brew "nvm"
brew "gh"
brew "pnpm"
brew "yarn"
brew "mas"

cask "font-fantasque-sans-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-fira-code"

cask "cloudflare-warp"
cask "protonmail-bridge"
cask "vlc"
cask "gpg-suite"
cask "dropbox"
cask "dropbox-capture"
cask "raycast" unless system "test -e /Applications/Raycast.app"
cask "visual-studio-code" unless system "test -e /Applications/Visual\\ Studio\\ Code.app"
cask "google-chrome" unless system "test -e /Applications/Google\\ Chrome.app"
cask "firefox" unless system "test -e /Applications/Firefox.app"
cask "slack" unless system "test -e /Applications/Slack.app"
cask "docker" unless system "test -e /Applications/Docker.app"
