cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "python"
brew "zsh"
brew "jq"
brew "coreutils"
brew "git"
brew "awscli"
brew "nvm"
brew "gh"
brew "pnpm"
brew "yarn"
brew "mas"

cask "font-fantasque-sans-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-fira-code"

cask "gpg-suite" unless system "test -e /Applications/GPG\\ Keychain.app"
cask "obsidian" unless system "test -e /Applications/Obsidian.app"
cask "raycast" unless system "test -e /Applications/Raycast.app"
cask "visual-studio-code" unless system "test -e /Applications/Visual\\ Studio\\ Code.app"
cask "google-chrome" unless system "test -e /Applications/Google\\ Chrome.app"
cask "firefox" unless system "test -e /Applications/Firefox.app"
cask "slack" unless system "test -e /Applications/Slack.app"
cask "docker" unless system "test -e /Applications/Docker.app"
cask "logi-options-plus" unless system "test -e /Applications/Logi\\ Options+.app"
cask "vlc" unless system "test -e /Applications/VLC.app"
cask "dropbox" unless system "test -e /Applications/Dropbox.app"
cask "dropbox-capture" unless system "test -e /Applications/Dropbox\\ Capture.app"

# NOTE: Sometimes I might want to comment these out
cask "cloudflare-warp" unless system "test -e /Applications/Cloudflare\\ WARP.app"
cask "protonvpn" unless system "test -e /Applications/ProtonVPN.app"
cask "protonmail-bridge" unless system "test -e /Applications/Proton\\ Mail\\ Bridge.app"
